package oppStandard;

public class Resume {
    /**
     * 1.类与对象
     * 类是一个模板 ： 抽象， 对象是一个具体的实例
     * 2.方法 ： 定义，调用
     * 3.对象的引用
     * 引用类型： 除了基本类型（8）以外
     * 对象是通过引用来操作的 桟--->堆 （引用就是指向对象的一个地址）
     * 4.属性： 字段 Field 成员变量
     * 默认初始化：
     * 数字： 0 0.0
     * char: u0000
     * boolean: false
     * 引用类型： null
     * 属性如何定义
     * 修饰符 属性类型 属性名 = 属性值 ！
     * 5.对象的创建和使用
     * -必须使用 new 关键字创造对象，构造器 Person chang = new Person();
     * -对象的属性 chang.name
     * -对象的方法 chang.sleep()
     *6.类
     *静态的属性 —— 属性
     *动态的行为 —— 方法
     */
}
